# "Создание словаря товара"
#
# Создайте словарь, представляющий товар, с ключами "название", "цена" и "количество".
# Присвойте ключам произвольные значения.


# 1. Выведите словарь на экран.
# 2. Выведите на экран название товара и его цену, используя ключи словаря

<<<<<<< HEAD
ware = {

        "название"   : "овощ",
        "цена"       : "15 т"  ,
        "количество" : "20 шт "

}
value = ware['цена']
print(value)
=======
item = {
    "name": "Кеды",
    "cost": 12.5,
    "count": 10
}

print(item)
print(item["name"])
print(item["cost"])
>>>>>>> 79e048c3d328c1b37987ef1362fc72e94e4190b3
