# "Изменение словаря товара"
#
# Создайте словарь, представляющий товар, с ключами "название", "цена" и "количество".
# Присвойте ключам произвольные значения.

# Увеличьте количество товара на 5.
# Измените цену товара на новую.
# Выведите обновленный словарь на экран.

<<<<<<< HEAD
ware = {

        "название"   : "овощ",
        "цена"       : "15 т"  ,
        "количество" : "25 шт "

}

ware['цена'] = 20
ware['количество'] = 30
print('f.change["цена"]',ware)
=======
item = {
    "name": "Кеды",
    "cost": 12.5,
    "count": 10
}
item["count"] += 5 # Ctrl + D
item["cost"] = 10.2

print(item)
>>>>>>> 79e048c3d328c1b37987ef1362fc72e94e4190b3
