# "Изменение словаря товара"
#
# Создайте словарь, представляющий товар, с ключами "название", "цена" и "количество".
# Присвойте ключам произвольные значения.

# Увеличьте количество товара на 5.
# Измените цену товара на новую.
# Выведите обновленный словарь на экран.

ware = {

        "название"   : "овощ",
        "цена"       : "15 т"  ,
        "количество" : "25 шт "

}

ware['цена'] = 20
ware['количество'] = 30
print('f.change["цена"]',ware)
