# "Добавление нового ключа в словарь"
#
# Создайте словарь товара с ключами "название", "цена" и "количество".
# Добавьте новый ключ "производитель" и присвойте ему значение.
# Выведите обновленный словарь на экран.

item = {
<<<<<<< HEAD

    "name" : "кеды",
    "cost" : 12.5,
    "count" : 10
}

=======
    "name": "Кеды",
    "cost": 12.5,
    "count": 10
}

item["manufacturer"] = "Тайвань"

print(item)
>>>>>>> 79e048c3d328c1b37987ef1362fc72e94e4190b3
