## "Квадрат символами"

### Задание

Дана сторона квадрата. Вывести его контур символами *.

### Формат входных данных

Дано целое число n, длина стороны квадрата. 2 <= n <= 20

### Формат выходных данных

Вывести квадрат размером n x n, состоящий из символов * (см. примеры).

#### Примеры

n = 4 
```
****
*  *
*  *
****
```
n = 3
```
***
* *
***
```
### Решение задачи

```python
n = int(input("n: ")) # n = 3

for i in range(n):
    if i == 0 or i == n-1:
        print("*"*n)
    else:
        print("*"+ " "*(n-2) + "*")
```
