## "Ромб символами"

### Задание

Дана длина стороны ромба. Вывести его контур символами `+`.

### Формат входных данных

Дано целое число `side`, длина стороны ромба. `2 <= side <= 15`.

### Формат выходных данных

Вывести контур ромба, состоящий из символов `+` (см. примеры).

#### Примеры


side = 4 
```
   +
  + +
 +   +
+     +
 +   +
  + +
   +
```
side = 2
```
 +
+ +
 +
```
### Решение задачи


# TODO: you code here...
side = int(input("side :"))

if 2 <= side <= 15:
    for i in range(side):
        print(" " * (side - i - 1) + "+" + " " * (i * 2) + "+")
    for i in range(side - 2, -1, -1):
        print(" " * (side - i - 1) + "+" + " " * (i * 2) + "+")



else:
    print("side должна быть от 3 до 14.")
