## "Равнобедренный треугольник символами (контур)"

### Задание

Дана высота равнобедренного треугольника. Вывести его контур символами `/`, `\` и `_`.

### Формат входных данных

Дано целое число `height`, высота треугольника. `2 <= height <= 15`.

### Формат выходных данных

Вывести контур равнобедренного треугольника, состоящий из символов `/`, `\` и `_` (см. примеры).

#### Примеры

height = 4
```
   /\
  /  \
 /    \
/______\
```
height = 3
```
  /\
 /  \
/____\
```
### Решение задачи


height = int(input("Height: "))
if 2 <= height <= 15:
    for i in range(height):
        print(" " * (height - i - 1) + "/" + " " * (i * 2) + "\\")
    print("_" * (height * 2))
else:
    print("Высота должна быть от 2 до 15.")

```
