## "Песочные часы символами"

### Задание

Дано целое положительное число `rows`, определяющее количество строк в верхней (и нижней) части "треугольников", образующих песочные часы. Написать функцию, которая выводит в терминал изображение песочных часов, состоящих из символов `*`.

### Формат входных данных

Дано целое число `rows`. `2 <= rows <= 15`.

### Формат выходных данных

Вывести изображение песочных часов, состоящее из символов `*` (см. примеры).

#### Примеры

rows = 4
```
*******
 *****
  ***
   *
  ***
 *****
*******
```
rows = 2
```
***
 *
***
```
### Решение задачи

## "Песочные часы символами"
rows = int(input("rows : "))


def one(i):
    for i in range(rows):
        if 2 <= rows <= 15:
            stars = (rows - i) * 2 - 1
            spaces = i
            print(" " * spaces + "*" * stars)


def two(j):
    for j in range(rows - 2, -1, -1):

        if 2 <= rows <= 15:
            stars = (rows - j) * 2 - 1
            spaces = j
            print(" " * spaces + "*" * stars)


one(1), two(1)
