## "Диагонали символами"

### Задание

Даны сторона квадрата. Вывести его диагонали символами #

### Формат входных данных

Дано целое число n, длина стороны квадрата. 3 < n < 20 

### Формат выходных данных

Вывести диагонали квадрата символами # (см. примеры)

#### Примеры

n = 6 
```
#    #
 #  #
  ##
  ##
 #  #
#    #
```
n = 3
```
# #
 #
# #
```
### Решение задачи

## "Диагонали символами"


n = int(input("n : "))

if 3 < n < 20:
    for i in range(n):
        line = [" "] * n
        line[i] = "#"

        line[n - 1 - i] = "#"
        print("".join(line))
else:
    print("n должно быть между 4 и 19")
