# Дан код задачи "Длины слов":
words = ["hello", "world", "python"]
lengths = []
for word in words:
    lengths.append(len(word))
print(lengths)

# Перепишите его, используя list comprehensions:

text = [x words for word in words :
