## "Амеба"

### Задание

Амеба начинает делиться каждую минуту на две новые амебы. Определите, сколько амеб будет через заданное количество минут.

### Формат входных данных

Дано одно целое неотрицательное число — количество минут.

### Формат выходных данных

Вывести общее количество амеб.

### Решение задачи

```python
amoebas = 1
n = int(input("целое неотрицательное число: "))
if n == 0:
    print(f"количество амеб за {n} минут: {amoebas} ")
else:
    for i in range(n):
        amoebas *= 2
    print(f"количество амеб за {n} минут: {amoebas} ")

print("---v2--")

amoebas = 2 ** n
print(f"количество амеб за {n} минут: {amoebas}")
```
---

### Данные для самопроверки

| Дано | Результат |
|:----:|:---------:|
|  0   |     1     |
|  1   |     2     |
|  2   |     4     |
|  3   |     8     |
|  5   |    32     |
