## "Амеба"

### Задание

Амеба начинает делиться каждую минуту на две новые амебы. Определите, сколько амеб будет через заданное количество минут.

### Формат входных данных

Дано одно целое неотрицательное число — количество минут.

### Формат выходных данных

Вывести общее количество амеб.

### Решение задачи

## "Амеба"


def num():
    while True:
        minutes = int(input("min : "))
        if minutes > -1:
            return minutes
        else:
            print("Число должно быть положительное!")


# Амебы

def am(minutes):
    if minutes == 0:
        return 1
    periods = (minutes // 1)
    return 2 ** periods


time = num()
amoebas = am(time)

print(f"{amoebas} ам. за {time} мин.")


### Данные для самопроверки

| Дано | Результат |
|:----:|:---------:|
|  0   |     1     |
|  1   |     2     |
|  2   |     4     |
|  3   |     8     |
|  5   |    32     |
