## "Пирамида"

### Задание

Из остатков кирпичей Сергей сложил пирамиду. \
На вершине пирамиды лежит один кирпич, на втором сверху ряду два кирпича,
на третьем - три, и т.д., в нижнем ряду пирамиды количество кирпичей равно количеству уровней пирамиды.
После этого он написал на каждом кирпиче по числу, равному количеству кирпичей на этом уровне,
т.е. на верхнем уровне 1, на втором уровне 2, и т.д. \
Определите сумму чисел написанных на кирпичах.

### Формат входных данных

Дано одно целое положительное число — количество уровней в пирамиде

### Формат выходных данных

Вывести сумму чисел написанных на кирпичах

### Решение задачи

```python
n = int(input("количество уровней в пирамиде: "))
lines_sum = 0
for i in range(n):
    lines_sum += sum(list(i+1 for _ in range(i + 1)))
    # print(list(i+1 for _ in range(i + 1)))
    # print(f"sum = {sum(list(i+1 for _ in range(i + 1)))}")

print(f"lines_sum = {lines_sum}")

# ChatGPT
print(f"ChatGPT line_sum = {sum(i * i for i in range(1, n + 1))}")
```

---

### Данные для самопроверки

| Дано | Результат |
| :---: | :---: |
|    2    | 5 |
|    3    | 14 |
|    5    | 55  |
|    7    | 140 |

### Подсказки

<details>
<summary>Подсказка-1</summary>
Возьмите ручку и листок бумаги, нарисуйте условия задачи. Из рисунка вам станет понятно, как посчитать сумму чисел на каждом этаже.
</details>

<details>
<summary>Подсказка-2</summary>
Если вы поняли, как посчитать сумму, зная номер этажа. То остается просто пройти по всем этажам и найти общую сумму на всех.

Смотри пример "Нахождение суммы чисел в диапазоне [a, b]"
</details>
