## "Делители числа"

### Задание

Найдите все делители заданного числа.

### Формат входных данных

Дано целое положительное число.

### Формат выходных данных

Вывести все делители данного числа, кроме единицы и самого числа. \
Если делителей(отличных от единицы и самого числа) нет, то вывести "Число простое"

### Решение задачи

## "Делители числа"

n = int(input("Целое положительное число :"))
if n < 0:
    print(" число должно быть положительное ! ")
    n = int(input("Целое положительное число :"))
else:
    print(" : ", n)
result = []
for i in range(2, n + 1):
    if n % i == 0:
        result.append(i)
        print(i)


### Данные для самопроверки

| Дано | Результат |
| :---: | :--- |
|    4    | 2 |
|    8    | 2 4  |
|    11    | Число простое |
|    14    | 2 7  |
|    20   | 2 4 5 10  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Если одно число делится без остатка на другое, то второе называют — делителем первого
</details>

<details>
<summary>Подсказка-2</summary>
Самый простой способ решить данную задачу - просто перебрать все числа от 2-ки до заданного числа и проверить, делится ли заданное число на них без остатка.
</details>
