## "Совершенное число"

### Задание

Число совершенно, если оно равно сумме всех своих делителей, кроме самого себя. Пример: 6 = 1 + 2 + 3. \
Проверить, является ли данное число совершенным.

### Формат входных данных

Дано целое положительно число.

### Формат выходных данных

Вывести "Да", если число совершенно и "Нет" в противоположном случае.

### Решение задачи

## "Совершенное число"

num = int(input("целое положительно число : "))
if num < 0:
    print(" число должно быть положительное ! ")
    num = int(input("Целое положительное число :"))
else:
    print("дано : ", num)
sum_divisors = 0
for i in range(1, num // 2 + 1):
    if num % i == 0:
        sum_divisors += i

if sum_divisors == num:
    print("Да")
else:
    print("Нет")

### Данные для самопроверки

| Дано | Результат |
| :---: | --- |
|    4    | Нет |
|    6    | Да  |
|    14    | Нет |
|    22    | Нет |
|    28    | Да  |
|    100    | Нет  |
|    496   | Да  |
### Подсказки

<details>
<summary>Подсказка-1</summary>
Воспользуйтесь решение предыдущей задачи "Делители числа" и найдите их сумму.
</details>
