# Напишите функцию, которая принимает список чисел и возвращает сумму квадратов этих чисел.

<<<<<<< HEAD


def square(x):
 return x**2
x = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

squad = sum(map(square, x))
print(squad)
=======
def sqrt(number):
    return number * number

numbers = [4, 6, 2, -5, 10, 3]

res = sum(map(sqrt, numbers))
print(res)
>>>>>>> 26acaefa2974c19008732e59e9eb711ea6eb273c
