# Дан готовый код
# def multiply_by_ten(y):
#   return y * 10


values = [1, 5, 10]
lambda_values = list(map(lambda x: x * 10, values))

# multiplied_values = list(map(multiply_by_ten, values))
print(lambda_values)

# Задача: перепишите код, используя lambda-функцию
