## "Пропуск некорректных данных"

### Задание

Дан файл [data/info.txt](data/info.txt), в каждой строке которого содержится строка или целое число. \
Найдите сумму всех чисел, пропуская все строки, которые нельзя преобразовать к типу int.

### Формат входных данных

Дан текстовый файл, на каждой строке которого целое число или произвольный текст.

### Формат выходных данных

Программа ничего не выводит в терминал, все сообщения записываются в указанный файл или в файл по умолчанию.

### Решение задачи
def is_integer(s):
    """
    Проверяет, является ли строка целым числом.
    Параметры:
        s (str): строка, которую нужно проверить.
    Возвращает:
        bool: True, если строка представляет целое число, иначе False.
    """
    try:
        int(s)
        return True
    except ValueError:
        return False

def calculate_sum(in_file="data/info.txt", out_file="data/total_sum.txt"):
    """
    Считывает целые числа из текстового файла, суммирует их и записывает результат в другой файл.
    Параметры:
        in_file (str): путь к входному файлу с числами (по одному на строку).
        out_file (str): путь к выходному файлу, куда будет записана сумма.
    Возвращает:
        None
    """
    summa = 0
    with open(in_file, "r") as f:
        for line in f:
            line = line.strip()
            if is_integer(line):
                summa += int(line)
                # print(f"{line} -> {summa}")
    # print(f"Сумма чисел = {summa}")
    with open(out_file, "w", encoding="UTF-8") as f:
        str_summa = "Сумма чисел = " + str(summa)
        f.write(str_summa)



calculate_sum()
```

---
