## "Вывод в файл: Пирамида"

### Задание

Выведите в файл **pyramid.txt** пирамиду из n строк.

Пример:
```
n = 5
    *
   ***
  *****
 *******
*********
```
```
n = 6
     *
    ***
   *****
  *******
 *********
***********
```
**Пояснение**: в каждой строке символов на два больше, чем в предыдущей, символы выровнены по центру по длине самой нижней строки.
### Формат входных данных

Дано целое положительное число, высота(количество строк) пирамиды.

### Формат выходных данных

Программа ничего не выводит в терминал, все символы для отображения пирамиды выводим в файл.

### Решение задачи

def generate_pyramid(n, filename="pyramid.txt"):
    """
    Записывает пирамиду из n строк в указанный файл.
    Параметры:
    n (int): количество строк в пирамиде.
    filename (str): имя файла для записи (по умолчанию 'pyramid.txt').
    """
    with open(filename, "w") as f:
        line = "*"
        for i in range(1, n + 1):
            print(f"{line:^{n*2-1}}", file=f)
            line += "**"
            # variant_2
            # line = " " * (n - i) + "*" * (2 * i - 1)
            # if i != n:
            #     f.write(line + "\n")
            # else:
            #     f.write(line)


n = int(input("количество строк в пирамиде: "))

generate_pyramid(n)

---
<details>
<summary>Подсказка-1</summary>
Вспомните про форматирование строк

```python
line = "**"
print(f"{line:^8}")
```
</details>
