# Дан список из n элементов, заполненный произвольными целыми числами в диапазоне от -10 до 10.
# Вывести на экран сумму всех элементов.
Work
numers = [-4,9,-3,8,9]

print(str(numers))
print(numers[0]+numers[1]+numers[2]+numers[3]+numers[4])

# TODO: your code here1


# TODO: your code here
main
