# Дан кортеж заполненный целыми числами
# Найдите самый большой элемент кортежа
tup = (2, 4, 6, -4, 12, 0, 5)

<<<<<<< HEAD

max_tulp = max(tup)

print("Самый большой элемнет : ", max_tulp)


# TODO: your code here
=======
result = max(tup)
print(result)
>>>>>>> 759f5857c41c75f65deba10d03e8b7641eeb8118
