# Дан кортеж заполненный целыми числами
# Найдите самый большой элемент кортежа
tup = (2, 4, 6, -4, 12, 0, 5)

Work
max_tulp = max(tup)

print("Самый большой элемнет : ", max_tulp)

main
# TODO: your code here
