# Дан список имен.
# Выведите все имена в одну строку через запятую

names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]
Work
names = str(
    names[0] + ", " + names[1] + ", " + names[2] + ", " + names[3] + ", " + names[4])
print(names)
# TODO: your code here



# TODO: your code here
main

# Пример вывода:
# Иван, Ирина, Вячеслав, Василий, Петр
