# Дан список имен.
# Найдите самое длинное имя, если таких имен несколько - выведи любое их них

# names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

# TODO: your code here
names = ["Иван", "Ирина", "Вячеслав", "Василий", "Петр"]

long_name = max(names, key = len)

print("самое длинное имя: ", long_name)
