# 1 коровА
# 2-4 коровЫ
# 5-20 короВ
# 21 коровА
# 22-24 коровЫ
# 25-30 короВ
# 31 коровА

# 101 - корова
# 111 - коров
# 112 - короВ
# 122 - короВЫ
# 113 - короВ
# 123 - короВЫ
# 12562 - коровЫ
# Вариант-1
n = int(input("Количество коров: "))  # 1 - 100
n2 = n % 100
if n2 % 10 == 1 and n2 != 11:
    print(n, "коровА")
elif 2 <= n2 % 10 <= 4 and not 12 <= n2 <= 14:
    print(n, "коровЫ")
else:
    print(n, "коров")

# Вариант-2
# x = int(input(("Enter the number of cows: ")))
#
# if 11 <= x % 100 <= 14:
#     ending = "коров"
# elif x % 10 == 1:
#     ending = "корова"
# elif 2 <= x % 10 <= 4:
#     ending = "коровы"
# else:
#     ending = "коров"

# print(f"На лугу пасется {x} {ending}")
