## "Алгоритм Луна"

### Задание

Для шестнадцати значного номера банковской карты, определите корректность ее номера в соответствии с алгоритмом Луна. 

Про Алгоритм Луна можно почитать [тут](https://ru.wikipedia.org/wiki/%D0%90%D0%BB%D0%B3%D0%BE%D1%80%D0%B8%D1%82%D0%BC_%D0%9B%D1%83%D0%BD%D0%B0) или [тут](https://skobki.com/yazyk-c-proverka-nomera-kreditki/).

### Формат входных данных

Дано целое положительное шестнадцати значное число - номер банковской карты.

### Формат выходных данных

Вывести "Да", если номер карты является корректным или "Нет".

### Решение задачи

# Беру число как строку
number = input()

# Разбиваю на цифры и сразу превращаю в числа
digits = [int(d) for d in number]

# Удваиваю каждую вторую цифру, начиная с предпоследней (индексы 4, 2, 0)
i = 4
while i >= 0:
    digits[i] = digits[i] * 2
    if digits[i] > 9:
        digits[i] = digits[i] - 9
    i = i - 2

# Складываю все цифры
total = 0
for d in digits:
    total = total + d

# Проверяю, делится ли на 10
if total % 10 == 0:
    print("Да")
else:
    print("Нет")

---

### Подсказки

<details>
<summary>Подсказка-1</summary>
Для проверки результата можно воспользоваться
<a href="https://ilovecalc.com/calcs/maths/luhn-algorithm/1370/">
этим онлайн калькулятором
</a>
</details>

