## "Код Цезаря"

### Задание

Одним из первых в истории примеров шифрования считаются закодированные послания Юлия Цезаря. \
В результате он стал шифровать свои послания довольно простым методом, который впоследствии стали называть кодом Цезаря.

Идея шифрования была совершенно тривиальной и заключалась в циклическом сдвиге букв на три позиции. \
В итоге буква A превращалась в D, B -> E, C –> F и т. д. Последние три буквы алфавита переносились на начало. \
Таким образом, буква X становилась A, Y –> B, а Z –> C. Цифры и другие символы не подвергались шифрованию.

Напишите программу, реализующую код Цезаря.

### Формат входных данных

Дана произвольная строка текста.

### Формат выходных данных

Вывести строку, зашифрованную кодом Цезаря.

### Решение задачи

```python
# TODO: you code here...
```text = input("введите текст: ")
new_text = ""

for i in text:
    if i.isalpha():
        if i.islower():
            code = ord(i) + 3
            if code > ord('z'):
                code = code - 26
            new_text += chr(code)
        elif i.isupper():
            code = ord(i) + 3
            if code > ord('Z'):
                code = code - 26
            new_text = new_text + chr(code)
    else:
        new_text += i

print("ваш зашифрованный текст:", new_text)


---


