## "Код Цезаря"

### Задание

Одним из первых в истории примеров шифрования считаются закодированные послания Юлия Цезаря. \
В результате он стал шифровать свои послания довольно простым методом, который впоследствии стали называть кодом Цезаря.

Идея шифрования была совершенно тривиальной и заключалась в циклическом сдвиге букв на три позиции. \
В итоге буква A превращалась в D, B -> E, C –> F и т. д. Последние три буквы алфавита переносились на начало. \
Таким образом, буква X становилась A, Y –> B, а Z –> C. Цифры и другие символы не подвергались шифрованию.

Напишите программу, реализующую код Цезаря.

### Формат входных данных

Дана произвольная строка текста.

### Формат выходных данных

Вывести строку, зашифрованную кодом Цезаря.

### Решение задачи

```python
def caesar_cod(text, change):
    result = ""
    for char in text:
        if char.isalpha():
            char_new = ord('A') if char.isupper() else ord('a')
            result += chr((ord(char) - char_new + change) % 26 + char_new)
        else:
            result += char
    return result

text = input("текст: ")
change = int(input("сдвиг: "))
encrypted_text = caesar_cod(text, change)
print("Шифрованный текст:", encrypted_text)
```

---


