# Создайте объект date, представляющий 1 января 2023 года, и выведите его на экран.
from datetime import date

<<<<<<< HEAD
specific_date = date(2023, 1, 1)
print(f"Заданная дата: {specific_date}")
=======
my_data = date(2023, 1, 1)
print(my_data)
>>>>>>> 313dbff6d8a5cacc923f6a78edd0509c9d16bad3
