# Создайте объект date, представляющий 1 января 2023 года, и выведите его на экран.
from datetime import date

my_data = date(2023, 1, 1)
print(my_data)