# Задача "Моделирование броска костей"
# Используйте функцию random.randint() для имитации броска двух игральных костей (числа от 1 до 6).
# Выведите на экран результат броска каждой кости и их сумму.
import random
res1= random.randint(1,6)
res2 = random.randint(1,6)
res_3 = res1 +res2
print(res_3)

