# Задача "Моделирование броска костей"
# Используйте функцию random.randint() для имитации броска двух игральных костей (числа от 1 до 6).
# Выведите на экран результат броска каждой кости и их сумму.
import random

<<<<<<< HEAD

def dice():
    return random.randint(1, 6)


dice_1 = dice()
dice_2 = dice()

print(dice_1, dice_2)
=======
def dice_roll():
    return random.randint(1, 6)


dice1 = dice_roll()
dice2 = dice_roll()

print(dice1, dice2)
>>>>>>> 4f7cf1bf3d2dc2459cdaff08dc9316c53615f96f
